{
  "jurisdiction": "Established international business hub",
  "addressDescription": "Our principal office coordinates all European operations and serves as the central hub for cross-border legal matters.",
  "drivingLicence": {
    "headline": "Regulatory Context",
    "services": [
      "Guidance on Irish driving licence regulations",
      "Assistance with licence exchange from other jurisdictions",
      "Coordination with NDLS and Road Safety Authority",
      "EU Directive compliance for cross-border matters"
    ],
    "description1": "Our Irish practice provides comprehensive advisory services for driving licence matters, helping clients navigate the National Driver Licence Service (NDLS) requirements and EU cross-border recognition procedures.",
    "description2": "Ireland's driving licence system is administered by the Road Safety Authority through the National Driver Licence Service. As an EU member state, Ireland adheres to EU Directive 2006/126/EC, enabling mutual recognition of driving licences across member states under specified conditions."
  },
  "insolvency": {
    "headline": "Legal Framework",
    "services": [
      "Structured management of insolvency cases under Irish law",
      "Coordination with Irish courts and regulatory authorities",
      "Communication with insolvency practitioners and creditors",
      "Cross-border coordination within the European Union"
    ],
    "description1": "Our firm provides comprehensive support for insolvency proceedings in Ireland, offering structured management and coordination services that ensure compliance with Irish and European Union regulations.",
    "description2": "Ireland's insolvency regime operates under the Companies Act 2014 and is subject to EU Regulation on Insolvency Proceedings. Our firm ensures that all proceedings are conducted in full compliance with both Irish national law and applicable European regulations, providing clients with legally sound solutions for complex cross-border matters."
  },
  "city": "Dublin",
  "name": "Ireland",
  "address": "Merrion Square, Dublin 2, Ireland",
  "headOffice": true,
  "id": "ireland",
  "imageUrls": [
    "public/ireland-driving-licence-video-mp4", "public/uploads/cyper.avif","public/uploads/ireland-insolvency-cliff.jpg", "public/uploads/driving-licence_dublin-road-DiNCimGx.webp", "public/uploads/head-office-ireland-location.webp"
  ]
}
